---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeSettings.GetFlowConvertionServerInfo
source: html/9ab99425-32ed-3b7b-2353-2d76cc364468.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.GetFlowConvertionServerInfo Method

Get the MEPServerInfo of the current plumbing flow convertion server.

## Syntax (C#)
```csharp
public MEPCalculationServerInfo GetFlowConvertionServerInfo()
```

## Returns
The MEPServerInfo of the current plumbing flow convertion server.